---
kind: method
id: M:Autodesk.Revit.UI.UIView.Dispose
source: html/53a0ecf2-3fdc-eebe-6601-24643436b357.htm
---
# Autodesk.Revit.UI.UIView.Dispose Method

Releases all resources used by the UIView

## Syntax (C#)
```csharp
public void Dispose()
```